# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_8e656297/fv_8e656297_prove/src/
read -formal fifo.sv
read -formal fifo_sva.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
