# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_f036e8c3/assertions/formal_f036e8c3__05_assert_read_dec/formal_f036e8c3__05_assert_read_dec_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
