# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_ee8b5d88/formal_ee8b5d88_bmc/src/
read -formal formal_ee8b5d88_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
