# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_d021f2a8/assertions/fv_d021f2a8__06__auto_assert_fifo_write_not_empty/fv_d021f2a8__06__auto_assert_fifo_write_not_empty_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
