# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_c6ac59f6/formal_c6ac59f6_bmc/src/
read -formal formal_c6ac59f6_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
