# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_945c04f9/formal_945c04f9_bmc/src/
read -formal formal_945c04f9_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
