# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_59af6849/assertions/formal_59af6849__08_ap_fifo_write_32_full/formal_59af6849__08_ap_fifo_write_32_full_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
