# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_532b73e9/formal_532b73e9_bmc/src/
read -formal formal_532b73e9_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
