# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_1c5f85a0/assertions/formal_1c5f85a0__04_ap_fifo_empty_prev_read_no_write/formal_1c5f85a0__04_ap_fifo_empty_prev_read_no_write_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
