# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_73c65fcc/assertions/formal_73c65fcc__01_ap_fifo_not_full_empty/formal_73c65fcc__01_ap_fifo_not_full_empty_bmc/src/
read -formal formal_73c65fcc__01_ap_fifo_not_full_empty_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
