# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_ada4dfec/assertions/fv_ada4dfec__03_ap_fifo_empty_prev_read/fv_ada4dfec__03_ap_fifo_empty_prev_read_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
