# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_99f38bec/assertions/formal_99f38bec__07_ap_fifo_read_write_equal/formal_99f38bec__07_ap_fifo_read_write_equal_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
