# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_0c5f9432/assertions/formal_0c5f9432__05_ap_fifo_write_not_empty/formal_0c5f9432__05_ap_fifo_write_not_empty_bmc/model/
read_rtlil design.il
scc -select; simplemap; select -clear
memory_nordff
async2sync
chformal -assume -early
opt_clean
formalff -setundef -clk2ff -ff2anyinit -hierarchy
chformal -live -fair -cover -remove
opt_clean
check
setundef -undriven -anyseq
opt -fast
rename -witness
opt_clean
write_rtlil ../model/design_prep.il
