# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_d6545820/formal_d6545820_bmc/src/
read -formal formal_d6545820_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
