# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/debug_fifo2/debug_fifo2_bmc/src/
read -formal fifo.sv
read -formal fifo_formal_checker_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
