# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_a8054294/assertions/fv_a8054294__05_ap_fifo_empty_stable/fv_a8054294__05_ap_fifo_empty_stable_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
