# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_df7fd5ca/formal_df7fd5ca_bmc/src/
read -formal formal_df7fd5ca_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
