# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_9430016b/assertions/formal_9430016b__03_ap_fifo_full_prev_write/formal_9430016b__03_ap_fifo_full_prev_write_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
