# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_9430016b/assertions/formal_9430016b__04_ap_fifo_empty_prev_read_no_write/formal_9430016b__04_ap_fifo_empty_prev_read_no_write_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
