# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_780b2ce6/fv_780b2ce6_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
