# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_da13696c/assertions/fv_da13696c__01__auto_assert_fifo_not_full_empty/fv_da13696c__01__auto_assert_fifo_not_full_empty_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
