# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_ba63cf73/formal_ba63cf73_bmc/src/
read -formal formal_ba63cf73_monitor.sv
prep -top fifo_checker

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
