# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_ba63cf73/formal_ba63cf73_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
