# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_f036e8c3/assertions/formal_f036e8c3__10_assert_count_stable/formal_f036e8c3__10_assert_count_stable_bmc/src/
read -formal formal_f036e8c3__10_assert_count_stable_monitor.sv
prep -top fifo_checker

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
