# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_0c4f874c/formal_0c4f874c_bmc/src/
read -formal formal_0c4f874c_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
