# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_720620af/formal_720620af_bmc/src/
read -formal formal_720620af_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
