# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_59af6849/assertions/formal_59af6849__01_ap_fifo_not_full_empty/formal_59af6849__01_ap_fifo_not_full_empty_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
