# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_99f38bec/assertions/formal_99f38bec__09_ap_fifo_data_after_empty/formal_99f38bec__09_ap_fifo_data_after_empty_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
