# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_62978fc9/formal_62978fc9_bmc/model/
read_rtlil design.il
scc -select; simplemap; select -clear
memory_nordff
async2sync
chformal -assume -early
opt_clean
formalff -setundef -clk2ff -ff2anyinit -hierarchy
chformal -live -fair -cover -remove
opt_clean
check
setundef -undriven -anyseq
opt -fast
rename -witness
opt_clean
write_rtlil ../model/design_prep.il
