# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/axi_buggy_fail/axi_buggy_fail_bmc/src/
read -formal axi_buggy_fail.sv
read -formal axi_formal_checker_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
