# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_c6609df1/formal_c6609df1_bmc/src/
read -formal formal_c6609df1_monitor.sv
prep -top fifo_checker

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
