# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/axi_correct_fail/axi_correct_fail_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
