# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_88d35961/formal_88d35961_bmc/src/
read -formal formal_88d35961_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
