# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_88d35961/formal_88d35961_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
