# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_1c5f85a0/assertions/formal_1c5f85a0__07_ap_fifo_read_write_equal/formal_1c5f85a0__07_ap_fifo_read_write_equal_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
