# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_73c65fcc/assertions/formal_73c65fcc__04_ap_fifo_empty_prev_read_no_write/formal_73c65fcc__04_ap_fifo_empty_prev_read_no_write_bmc/src/
read -formal formal_73c65fcc__04_ap_fifo_empty_prev_read_no_write_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
