# running in /Users/gautamthakur/Downloads/veriAssist-imp/veriassist/backend/data/formal_work/fv_ada4dfec/assertions/fv_ada4dfec__06_ap_fifo_rw_simultaneous/fv_ada4dfec__06_ap_fifo_rw_simultaneous_bmc/src/
read -formal fifo.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
