# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_e90b47c4/formal_e90b47c4_bmc/src/
read -formal formal_e90b47c4_monitor.sv
prep -top fifo_checker

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
