# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_13eacc54/assertions/formal_13eacc54__03_ap_fifo_full_prev_write/formal_13eacc54__03_ap_fifo_full_prev_write_bmc/src/
read -formal formal_13eacc54__03_ap_fifo_full_prev_write_monitor.sv
prep -top fifo

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
