# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_0c5f9432/assertions/formal_0c5f9432__06_ap_fifo_empty_after_reset/formal_0c5f9432__06_ap_fifo_empty_after_reset_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
