# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_d0aff902/assertions/formal_d0aff902__02_ap_fifo_onehot0_full_empty/formal_d0aff902__02_ap_fifo_onehot0_full_empty_bmc/src/
read -formal dut.sv
read -formal fifo_sva_monitor.sv
read -formal formal_wrapper.sv
prep -top formal_wrapper

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
