# running in /Users/gautamthakur/Downloads/veriassist/backend/data/formal_work/formal_0c5f9432/assertions/formal_0c5f9432__03_ap_fifo_full_prev_write/formal_0c5f9432__03_ap_fifo_full_prev_write_bmc/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
